# 假设商店老板需要找零n元钱，钱币的面额有：100元、50元、20元、5元、1元，如何找零使得所需钱币的数量最小？

t = [100, 50, 20, 5, 1]
 
def change(t, n):   # n指的总金额
    m = [0 for _ in range(len(t))]   # 创建一个和t一样长但全是0的列表
    # 这里假设t都是倒序排好的
    for i, money in enumerate(t):
        m[i] = n // money  # n整除money:376//100=3
        n = n % money  # n对money取余:376%100=76
    return m, n   # 如果到最后找不开，n就是找不开的钱
 
print(change(t, 376))    # ([3, 1, 1, 1, 1], 0)   即：300+50+20+5+1
 
# 如果t = [100, 50, 20, 5]，则有1块钱找不开，
print(change(t, 451))    # ([4, 1, 0, 0], 1)　
